W8D1/reddit/app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "author_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "wonder if her insides feel liek my gf"], ["author_id", 3], ["post_id", 4], ["created_at", "2020-02-03 23:24:37.759689"], ["updated_at", "2020-02-03 23:24:37.759689"]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.author_id = current_user.id
    @comment.post_id = params[:post_id]
    unless @comment.save

UPDATE "comments" SET "content" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["content", "  wonder if her insides feel liek my gf\r\n  very nice"], ["updated_at", "2020-02-03 23:59:48.522603"], ["id", 4]]
---
  def update
    @comment = current_user.comments.find_by(id: params[:id])
    if @comment.update(comment_params)