W8D1/reddit/app/controllers/posts_controller.rb

  def new
    @post = Post.new
    @sub = Sub.find_by(id: params[:sub_id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @post = Post.new(post_params)
    @post.author_id = current_user.id
    @post.sub_id = params[:sub_id]

    if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def edit
    @post = current_user.posts.find_by(id: params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def update
    @post = current_user.posts.find_by(id: params[:id])
    if @post.update!(post_params)
---
UPDATE "posts" SET "url" = $1, "content" = $2, "updated_at" = $3 WHERE "posts"."id" = $4

  def show
    @post = Post.includes(:sub).includes(:author).find_by(id: params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "subs".* FROM "subs" WHERE "subs"."id" = $1  [["id", 1]]