W6D4/rac/app/models/collection.rb

  def already_added
    artwork = Collection.find_by(artwork_id: self.artwork_id, user_id: self.user_id, name: self.name)
---
SELECT  "collections".* FROM "collections" WHERE "collections"."artwork_id" = $1 AND "collections"."user_id" = $2 AND "collections"."name" = $3 LIMIT $4  [["artwork_id", 22], ["user_id", 22], ["name", "my collection"], ["LIMIT", 1]]