W6D4/rac/app/models/like.rb

  def already_liked
    like = Like.find_by(likeable_id: self.likeable_id, user_id: self.user_id, likeable_type: self.likeable_type)
---
SELECT  "likes".* FROM "likes" WHERE "likes"."likeable_id" = $1 AND "likes"."user_id" = $2 AND "likes"."likeable_type" = $3 LIMIT $4  [["likeable_id", 23], ["user_id", 21], ["likeable_type", "Artwork"], ["LIMIT", 1]]