W11D3/bench_project/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "test"], ["LIMIT", 1]]
---
  def self.find_by_credentials(user_params)
    user = User.find_by(username: user_params[:username])