W6D4/rac/app/controllers/artworks_controller.rb

  def index
    render json: Artwork.where(artist_id: params[:user_id]) + User.find(params[:user_id]).shared_artworks
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 4]]

  def show
    artwork = Artwork.find(params[:id])
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1  [["id", 4]]