W6D4/rac/app/controllers/likes_controller.rb

  def create
    # render json: params
    if params.has_key?(:comment_id)
      like = Like.new(user_id: params[:user_id], likeable: Comment.find(params[:comment_id]))
    elsif params.has_key?(:artwork_id)
      like = Like.new(user_id: params[:user_id], likeable: Artwork.find(params[:artwork_id]))
    end
    begin
      if like.save
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
INSERT INTO "likes" ("user_id", "likeable_type", "likeable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 16], ["likeable_type", "Comment"], ["likeable_id", 15], ["created_at", "2020-01-23 19:18:10.415408"], ["updated_at", "2020-01-23 19:18:10.415408"]]