W6D4/rac/app/controllers/users_controller.rb

  def index

    if params.has_key?(:name)
      render json: User.where("upper(name) LIKE upper('#{params[:name]}')")
    else
      render json: User.all
---
SELECT "users".* FROM "users" WHERE (upper(name) LIKE upper('Alex'))
SELECT "users".* FROM "users"

  def destroy
    user = User.find(params[:id]).destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]

  def favorite
    render json: Artwork.where(artist_id: params[:id], favorite: true)
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1 AND "artworks"."favorite" = $2  [["artist_id", 14], ["favorite", true]]