W8D1/reddit/app/views/subs/show.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
---
      <% end %>
      <%= post.comments.count %> comment(s)