W6D3/rac/app/models/artwork_share.rb

  def shared
    artwork_share = ArtworkShare.find_by(artwork_id: self.artwork_id, viewer_id: self.viewer_id)
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."artwork_id" = $1 AND "artwork_shares"."viewer_id" = $2 LIMIT $3  [["artwork_id", 1], ["viewer_id", 4], ["LIMIT", 1]]