W6D3/rac/app/models/artwork.rb

  def artwork_title
    artwork = Artwork.find_by(artist_id: self.artist_id, title: self.title)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1 AND "artworks"."title" = $2 LIMIT $3  [["artist_id", 4], ["title", "masterpiece"], ["LIMIT", 1]]