W8D1/reddit/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "ifpkAZsmm5T8tjKcArCucIsMi6rwGMMx-lhXtTeGptz9GlznHmU2VyyklPhT-6qjdQlwNMmTvlwllMV4hDgukg"], ["updated_at", "2020-02-03 23:12:16.312386"], ["id", 3]]
---
  def reset_session_token!
    self.session_token = SecureRandom.urlsafe_base64(64)
    self.save!