W6D3/rac/app/controllers/artwork_shares_controller.rb

DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 5]]
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def destroy
    artwork_share = ArtworkShare.find(params[:id]).destroy