W10D5/Todo/app/controllers/api/todo_models_controller.rb

SELECT "todo_models".* FROM "todo_models"
---
  def index
    todos = TodoModel.all

INSERT INTO "todo_models" ("title", "body", "done", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Eat"], ["body", "Eat lunch"], ["done", false], ["created_at", "2020-02-21 20:14:41.086726"], ["updated_at", "2020-02-21 20:14:41.086726"]]
---
  def create
    todo = TodoModel.new(todo_params)

    if todo.save

SELECT  "todo_models".* FROM "todo_models" WHERE "todo_models"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "todo_models" SET "done" = $1, "updated_at" = $2 WHERE "todo_models"."id" = $3  [["done", true], ["updated_at", "2020-02-21 23:38:59.703419"], ["id", 1]]
---
  def update
    todo = TodoModel.find_by(id: params[:id])

    if todo.update(todo_params)

SELECT  "todo_models".* FROM "todo_models" WHERE "todo_models"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "todo_models" WHERE "todo_models"."id" = $1  [["id", 3]]
---
  def destroy
    todo = TodoModel.find_by(id: params[:id])
    todo.destroy